; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=34, remove_proportion=0.2, bases=6, instance_id=19, output=./training, seed=60

(define (problem warehouse-19)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 - box
        base1 base2 base3 base4 base5 base6 - base
    )
    (:init
        (to-remove box8)
        (to-remove box9)
        (to-remove box10)
        (to-remove box19)
        (to-remove box20)
        (to-remove box26)
        (clear box27)
        (on box27 box13)
        (on box13 box4)
        (on box4 box30)
        (on box30 box33)
        (on box33 box10)
        (on box10 box5)
        (on-base box5 base1)
        (clear box16)
        (on box16 box7)
        (on box7 box17)
        (on box17 box32)
        (on box32 box11)
        (on box11 box22)
        (on box22 box8)
        (on-base box8 base2)
        (clear box18)
        (on box18 box3)
        (on box3 box31)
        (on-base box31 base3)
        (clear box1)
        (on box1 box14)
        (on box14 box2)
        (on box2 box9)
        (on-base box9 base4)
        (clear box23)
        (on box23 box24)
        (on box24 box25)
        (on box25 box28)
        (on box28 box34)
        (on box34 box26)
        (on box26 box19)
        (on box19 box29)
        (on-base box29 base5)
        (clear box21)
        (on box21 box15)
        (on box15 box20)
        (on box20 box12)
        (on box12 box6)
        (on-base box6 base6)
    )
    (:goal (and 
        (removed box8)
        (removed box9)
        (removed box10)
        (removed box19)
        (removed box20)
        (removed box26)
    ))
)

; plan
1. (move box1 box14 box18)
   deleted: (clear box18) (on box1 box14)
   added: (on box1 box18) (clear box14)
   goals met: 0 of 6
2. (move box14 box2 box1)
   deleted: (clear box1) (on box14 box2)
   added: (on box14 box1) (clear box2)
   goals met: 0 of 6
3. (move box16 box7 box14)
   deleted: (clear box14) (on box16 box7)
   added: (on box16 box14) (clear box7)
   goals met: 0 of 6
4. (move box2 box9 box16)
   deleted: (clear box16) (on box2 box9)
   added: (on box2 box16) (clear box9)
   goals met: 0 of 6
5. (move box21 box15 box2)
   deleted: (clear box2) (on box21 box15)
   added: (on box21 box2) (clear box15)
   goals met: 0 of 6
6. (move box15 box20 box21)
   deleted: (clear box21) (on box15 box20)
   added: (on box15 box21) (clear box20)
   goals met: 0 of 6
7. (move box23 box24 box15)
   deleted: (clear box15) (on box23 box24)
   added: (on box23 box15) (clear box24)
   goals met: 0 of 6
8. (remove box20 box12)
   deleted: (on box20 box12) (clear box20)
   added: (removed box20) (clear box12)
   goals met: 1 of 6
9. (move box24 box25 box12)
   deleted: (clear box12) (on box24 box25)
   added: (on box24 box12) (clear box25)
   goals met: 1 of 6
10. (move box25 box28 box23)
   deleted: (clear box23) (on box25 box28)
   added: (on box25 box23) (clear box28)
   goals met: 1 of 6
11. (move box27 box13 box24)
   deleted: (clear box24) (on box27 box13)
   added: (on box27 box24) (clear box13)
   goals met: 1 of 6
12. (move box13 box4 box25)
   deleted: (clear box25) (on box13 box4)
   added: (on box13 box25) (clear box4)
   goals met: 1 of 6
13. (move box28 box34 box13)
   deleted: (clear box13) (on box28 box34)
   added: (on box28 box13) (clear box34)
   goals met: 1 of 6
14. (move box34 box26 box27)
   deleted: (clear box27) (on box34 box26)
   added: (on box34 box27) (clear box26)
   goals met: 1 of 6
15. (remove box26 box19)
   deleted: (on box26 box19) (clear box26)
   added: (removed box26) (clear box19)
   goals met: 2 of 6
16. (remove box19 box29)
   deleted: (on box19 box29) (clear box19)
   added: (removed box19) (clear box29)
   goals met: 3 of 6
17. (move box4 box30 box28)
   deleted: (clear box28) (on box4 box30)
   added: (on box4 box28) (clear box30)
   goals met: 3 of 6
18. (move box30 box33 box29)
   deleted: (clear box29) (on box30 box33)
   added: (on box30 box29) (clear box33)
   goals met: 3 of 6
19. (move box33 box10 box30)
   deleted: (clear box30) (on box33 box10)
   added: (on box33 box30) (clear box10)
   goals met: 3 of 6
20. (remove box10 box5)
   deleted: (on box10 box5) (clear box10)
   added: (removed box10) (clear box5)
   goals met: 4 of 6
21. (move box7 box17 box33)
   deleted: (clear box33) (on box7 box17)
   added: (on box7 box33) (clear box17)
   goals met: 4 of 6
22. (move box17 box32 box34)
   deleted: (clear box34) (on box17 box32)
   added: (on box17 box34) (clear box32)
   goals met: 4 of 6
23. (move box32 box11 box17)
   deleted: (clear box17) (on box32 box11)
   added: (on box32 box17) (clear box11)
   goals met: 4 of 6
24. (move box11 box22 box32)
   deleted: (clear box32) (on box11 box22)
   added: (on box11 box32) (clear box22)
   goals met: 4 of 6
25. (move box22 box8 box11)
   deleted: (clear box11) (on box22 box8)
   added: (on box22 box11) (clear box8)
   goals met: 4 of 6
26. (remove-from-base box8 base2)
   deleted: (on-base box8 base2) (clear box8)
   added: (removed box8) (clear-base base2)
   goals met: 5 of 6
27. (remove-from-base box9 base4)
   deleted: (on-base box9 base4) (clear box9)
   added: (removed box9) (clear-base base4)
   goals met: 6 of 6
